---
kind: type
id: T:Autodesk.Revit.DB.GeomCombinationSetIterator
source: html/2f5bbf46-374a-447c-73e2-91c0eb283e91.htm
---
# Autodesk.Revit.DB.GeomCombinationSetIterator

An iterator to a GeomCombination set.

## Syntax (C#)
```csharp
public abstract class GeomCombinationSetIterator : APIObject,
	IEnumerator
```